particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
/*
 * Copyright (c) 2018 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#include "logging.h"
LOG_SOURCE_CATEGORY("hal.ble")

#include "ble_hal.h"

#if HAL_PLATFORM_BLE

/* Headers included from nRF5_SDK/components/softdevice/s140/headers */
#include "ble.h"
#include "ble_gap.h"
#include "ble_gatt.h"
#include "ble_gatts.h"
#include "ble_gattc.h"
#include "ble_types.h"
/* Headers included from nRF5_SDK/components/softdevice/common */
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"

#include "app_util.h"

#include "concurrent_hal.h"
#include "static_recursive_mutex.h"
#include <mutex>

#include "gpio_hal.h"
#include "device_code.h"
#include "system_error.h"
#include "sdk_config_system.h"
#include "spark_wiring_vector.h"
#include "simple_pool_allocator.h"
#include <string.h>
#include <memory>

static_assert(NRF_SDH_BLE_PERIPHERAL_LINK_COUNT == 1, "Multiple simultaneous peripheral connections are not supported");
static_assert(NRF_SDH_BLE_TOTAL_LINK_COUNT <= 20, "Maximum supported number of concurrent connections in the peripheral and central roles combined exceeded");

using spark::Vector;

#define BLE_CONN_CFG_TAG 1

#define NRF_CHECK_RETURN(ret, str) \
        do { \
            const int _ret = ret; \
            const char* _str = str; \
            if (_ret != NRF_SUCCESS) { \
                if (_str != nullptr) { \
                    LOG(ERROR, "%s failed: %u", _str, _ret); \
                } \
                return sysError(_ret); \
            } \
        } while (false)

#define NRF_CHECK_RETURN_VOID(ret, str) \
        do { \
            const int _ret = ret; \
            const char* _str = str; \
            if (_ret != NRF_SUCCESS) { \
                if (_str != nullptr) { \
                    LOG(ERROR, "%s failed: %u", _str, _ret); \
                } \
            } \
        } while (false)

#define CHECK_RETURN(ret, str) \
        do { \
            const int _ret = ret; \
            const char* _str = str; \
            if (_ret != SYSTEM_ERROR_NONE) { \
                if (_str != nullptr) { \
                    LOG(ERROR, "%s failed: %u", _str, _ret); \
                } \
                return _ret; \
            } \
        } while (false)


#define CHECK_RETURN_VOID(ret, str) \
        do { \
            const int _ret = ret; \
            const char* _str = str; \
            if (_ret != SYSTEM_ERROR_NONE) { \
                if (_str != nullptr) { \
                    LOG(ERROR, "%s failed: %u", _str, _ret); \
                } \
                return; \
            } \
        } while (false)


StaticRecursiveMutex s_bleMutex;
class bleLock {
    static void lock() {
        s_bleMutex.lock();
    }
    static void unlock() {
        s_bleMutex.unlock();
    }
};

//anonymous namespace
namespace {

system_error_t sysError(uint32_t error) {
    switch (error) {
        case NRF_SUCCESS:                       return SYSTEM_ERROR_NONE;
        case NRF_ERROR_SVC_HANDLER_MISSING:
        case NRF_ERROR_NOT_SUPPORTED:           return SYSTEM_ERROR_NOT_SUPPORTED;
        case NRF_ERROR_SOFTDEVICE_NOT_ENABLED:
        case NRF_ERROR_INVALID_STATE:           return SYSTEM_ERROR_INVALID_STATE;
        case NRF_ERROR_INTERNAL:                return SYSTEM_ERROR_INTERNAL;
        case NRF_ERROR_NO_MEM:                  return SYSTEM_ERROR_NO_MEMORY;
        case NRF_ERROR_NOT_FOUND:               return SYSTEM_ERROR_NOT_FOUND;
        case NRF_ERROR_INVALID_PARAM:
        case NRF_ERROR_INVALID_LENGTH:
        case NRF_ERROR_INVALID_FLAGS:
        case NRF_ERROR_INVALID_DATA:
        case NRF_ERROR_DATA_SIZE:
        case NRF_ERROR_NULL:                    return SYSTEM_ERROR_INVALID_ARGUMENT;
        case NRF_ERROR_TIMEOUT:                 return SYSTEM_ERROR_TIMEOUT;
        case NRF_ERROR_FORBIDDEN:
        case NRF_ERROR_INVALID_ADDR:            return SYSTEM_ERROR_NOT_ALLOWED;
        case NRF_ERROR_BUSY:                    return SYSTEM_ERROR_BUSY;
        case NRF_ERROR_CONN_COUNT:              return SYSTEM_ERROR_LIMIT_EXCEEDED;
        case NRF_ERROR_RESOURCES:               return SYSTEM_ERROR_ABORTED;
        default:                                return SYSTEM_ERROR_UNKNOWN;
    }
}

bool addressEqual(const hal_ble_addr_t& srcAddr, const hal_ble_addr_t& destAddr) {
    return (srcAddr.addr_type == destAddr.addr_type && !memcmp(srcAddr.addr, destAddr.addr, BLE_SIG_ADDR_LEN));
}

} //anonymous namespace

class GattBase {
public:
    GattBase() {
        desiredAttMtu_ = BLE_MAX_ATT_MTU_SIZE;
        attMtuList_.clear();
    }
    ~GattBase() = default;

protected:
    /*
     * A device's Exchange MTU Request shall contain the same MTU as the
     * device's Exchange MTU Response (i.e. the MTU shall be symmetric).
     */
    class LinkAttMtu {
    public:
        uint16_t connHandle;
        uint16_t effective;
        bool isExchanged;
        LinkAttMtu() {
            connHandle = BLE_INVALID_CONN_HANDLE;
            effective = BLE_DEFAULT_ATT_MTU_SIZE;
            isExchanged = false;
        }
        ~LinkAttMtu() = default;
    };

    // GATT Server and GATT client share the same ATT_MTU.
    static uint16_t desiredAttMtu_;
    static Vector<LinkAttMtu> attMtuList_;

    size_t getAttMtu(uint16_t connHandle) {
        for (int i = 0; i < attMtuList_.size(); i++) {
            LinkAttMtu& attMtu = attMtuList_[i];
            if (attMtu.connHandle == connHandle) {
                return attMtu.effective;
            }
        }
        return 0;
    }

    void configureAttMtu(uint16_t connHandle, uint16_t effective, bool exchanged=false) {
        // Update the effective ATT_MTU if existed.
        for (int i = 0; i < attMtuList_.size(); i++) {
            LinkAttMtu& attMtu = attMtuList_[i];
            if (attMtu.connHandle == connHandle) {
                attMtu.effective = effective;
                attMtu.isExchanged = exchanged;
                return;
            }
        }
        // Set ATT_MTU for new link.
        LinkAttMtu effectAttMtu;
        effectAttMtu.connHandle = connHandle;
        effectAttMtu.effective = effective;
        attMtuList_.append(effectAttMtu);
    }

