particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    bool attMtuExchanged(uint16_t connHandle) {
        for (int i = 0; i < attMtuList_.size(); i++) {
            LinkAttMtu& attMtu = attMtuList_[i];
            if (attMtu.connHandle == connHandle) {
                return attMtu.isExchanged;
            }
        }
        return true;
    }

    void clearAttMtu(uint16_t connHandle) {
        for (int i = 0; i < attMtuList_.size(); i++) {
            LinkAttMtu& attMtu = attMtuList_[i];
            if (attMtu.connHandle == connHandle) {
                attMtuList_.removeAt(i);
            }
        }
    }

    static uint8_t toHalCharProps(ble_gatt_char_props_t properties) {
        uint8_t halProperties = 0;
        if (properties.broadcast) {
            halProperties |= BLE_SIG_CHAR_PROP_BROADCAST;
        }
        if (properties.read) {
            halProperties |= BLE_SIG_CHAR_PROP_READ;
        }
        if (properties.write_wo_resp) {
            halProperties |= BLE_SIG_CHAR_PROP_WRITE_WO_RESP;
        }
        if (properties.write) {
            halProperties |= BLE_SIG_CHAR_PROP_WRITE;
        }
        if (properties.notify){
            halProperties |= BLE_SIG_CHAR_PROP_NOTIFY;
        }
        if (properties.indicate) {
            halProperties |= BLE_SIG_CHAR_PROP_INDICATE;
        }
        if (properties.auth_signed_wr) {
            halProperties |= BLE_SIG_CHAR_PROP_AUTH_SIGN_WRITES;
        }
        return halProperties;
    }

    static void toPlatformCharProps(uint8_t halProperties, ble_gatt_char_props_t* properties) {
        memset(properties, 0x00, sizeof(ble_gatt_char_props_t));
        properties->broadcast = (halProperties & BLE_SIG_CHAR_PROP_BROADCAST) ? 1 : 0;
        properties->read = (halProperties & BLE_SIG_CHAR_PROP_READ) ? 1 : 0;
        properties->write_wo_resp = (halProperties & BLE_SIG_CHAR_PROP_WRITE_WO_RESP) ? 1 : 0;
        properties->write = (halProperties & BLE_SIG_CHAR_PROP_WRITE) ? 1 : 0;
        properties->notify = (halProperties & BLE_SIG_CHAR_PROP_NOTIFY) ? 1 : 0;
        properties->indicate = (halProperties & BLE_SIG_CHAR_PROP_INDICATE) ? 1 : 0;
        properties->auth_signed_wr = (halProperties & BLE_SIG_CHAR_PROP_AUTH_SIGN_WRITES) ? 1 : 0;
    }
};

uint16_t GattBase::desiredAttMtu_;
Vector<GattBase::LinkAttMtu> GattBase::attMtuList_;

class BleObject {
public:
    class BleEventDispatcher;
    class BleGap;
    class Broadcaster;
    class Observer;
    class ConnectionsManager;
    class GattServer;
    class GattClient;

    std::unique_ptr<BleEventDispatcher> dispatcher;         /**< BLE event dispatcher. */
    std::unique_ptr<BleGap> gap;                            /**< BLE GAP instance. */
    std::unique_ptr<Broadcaster> broadcaster;               /**< BLE Broadcaster instance. */
    std::unique_ptr<Observer> observer;                     /**< BLE Observer instance. */
    std::unique_ptr<ConnectionsManager> connectionsMgr;     /**< BLE connections manager instance. */
    std::unique_ptr<GattServer> gatts;                      /**< BLE GATT server instance. */
    std::unique_ptr<GattClient> gattc;                      /**< BLE GATT client instance. */

    static BleObject& getInstance(void);
    int init(void);
    int selectAntenna(hal_ble_ant_type_t antenna) const;

private:
    static bool initialized_;

    BleObject();
    ~BleObject() = default;
    static int toPlatformUUID(const hal_ble_uuid_t* halUuid, ble_uuid_t* uuid);
    static int toHalUUID(const ble_uuid_t* uuid, hal_ble_uuid_t* halUuid);
};

class BleObject::BleEventDispatcher {
public:
    typedef void (*BleSpecificEventHandler)(void* data, void* context);

    class EventMessage {
    public:
        hal_ble_evts_t evt;                 /**< BLE event data. */
        BleSpecificEventHandler handler;    /**< BLE specific event handler. */
        void* context;                      /**< BLE specific event context. */
        on_ble_evt_cb_t hook;               /**< Internal hook function after event being dispatched. */
        void* hookContext;                  /**< Internal hook function context. */
        EventMessage() {
            handler = nullptr;
            context = nullptr;
            hook = nullptr;
            hookContext = nullptr;
        }
        ~EventMessage() {}
    };

    BleEventDispatcher(BleObject* obj);
    ~BleEventDispatcher() = default;
    int init(void);
    int enqueue(EventMessage& msg);
    void onGenericEventCallback(on_ble_evt_cb_t cb, void* context);

private:
    class BleGenericEventHandler {
    public:
        on_ble_evt_cb_t handler;
        void* context;
        BleGenericEventHandler() {
            handler = nullptr;
            context = nullptr;
        }
        ~BleGenericEventHandler() = default;
    };

    os_queue_t evtQueue_;                                   /**< BLE event queue. */
    os_thread_t evtThread_;                                 /**< BLE event thread. */
    BleObject* bleObj_;                                     /**< Pointer to the BLE Object. */
    Vector<BleGenericEventHandler> genericEventHandlers_;   /**< BLE generic event handlers. */

    static os_thread_return_t bleEventDispatch(void* param);
};

class BleObject::BleGap {
public:
    BleGap(BleObject* obj);
    ~BleGap() = default;
    int init(void);
    int setDeviceName(const uint8_t* deviceName, uint16_t len);
    int getDeviceName(uint8_t* deviceName, uint16_t* len);
    int setDeviceAddress(const hal_ble_addr_t* address);
    int getDeviceAddress(hal_ble_addr_t* address);
    int setAppearance(uint16_t appearance);
    int getAppearance(uint16_t* appearance);
    int addWhitelist(const hal_ble_addr_t* addrList, uint8_t len);
    int deleteWhitelist(void);

private:
    ble_gap_addr_t whitelist_[BLE_MAX_WHITELIST_ADDR_COUNT];                /**< BLE device whitelist. */
    ble_gap_addr_t const* whitelistPointer_[BLE_MAX_WHITELIST_ADDR_COUNT];  /**< BLE device whitelists' pointer. */
    BleObject* bleObj_;                                                     /**< Pointer to the BLE Object. */

    static void processBleGapEvents(const ble_evt_t* event, void* context);
};

