particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
class BleObject::Broadcaster {
public:
    Broadcaster(BleObject* obj);
    ~Broadcaster() = default;
    int init(void);
    bool advertising(void) const;
    int setAdvertisingParams(const hal_ble_adv_params_t* params);
    int getAdvertisingParams(hal_ble_adv_params_t* params) const;
    int setAdvertisingData(const uint8_t* buf, size_t len);
    size_t getAdvertisingData(uint8_t* buf, size_t len) const;
    int setScanResponseData(const uint8_t* buf, size_t len);
    size_t getScanResponseData(uint8_t* buf, size_t len) const;
    int setTxPower(int8_t val);
    int8_t getTxPower(void) const;
    int startAdvertising(void);
    int stopAdvertising(void);

private:
    uint8_t isAdvertising_ : 1;                     /**< If it is advertising or not. */
    uint8_t advHandle_;                             /**< Advertising handle. */
    hal_ble_adv_params_t advParams_;                /**< Current advertising parameters. */
    uint8_t advData_[BLE_MAX_ADV_DATA_LEN];         /**< Current advertising data. */
    size_t  advDataLen_;                            /**< Current advertising data length. */
    uint8_t scanRespData_[BLE_MAX_ADV_DATA_LEN];    /**< Current scan response data. */
    size_t  scanRespDataLen_;                       /**< Current scan response data length. */
    int8_t  txPower_;                               /**< TX Power. */
    bool advPending_;                               /**< Advertising is pending. */
    uint16_t connHandle_;                           /**< Connection handle. It is assigned once device is connected
                                                         as Peripheral. It is used for re-start advertising. */
    BleObject* bleObj_;                             /**< Pointer to the BLE Object. */
    static const int8_t validTxPower_[8];           /**< Valid TX power values. */

    int suspend(void);
    int resume(void);
    void toPlatformAdvData(ble_gap_adv_data_t* data);
    int configure(const hal_ble_adv_params_t* params);
    static int8_t roundTxPower(int8_t value);
    static void toPlatformAdvParams(ble_gap_adv_params_t* params, const hal_ble_adv_params_t* halParams);
    static void processBroadcasterEvents(const ble_evt_t* event, void* context);
};

class BleObject::Observer {
public:
    Observer(BleObject* obj);
    ~Observer() = default;
    int init(void);
    bool scanning(void);
    int setScanParams(const hal_ble_scan_params_t* params);
    int getScanParams(hal_ble_scan_params_t* params) const;
    int startScanning(on_ble_scan_result_cb_t callback, void* context);
    int stopScanning(void);
    void toPlatformScanParams(ble_gap_scan_params_t* params) const;

private:
    uint8_t isScanning_: 1;                                 /**< If it is scanning or not. */
    hal_ble_scan_params_t scanParams_;                      /**< BLE scanning parameters. */
    os_semaphore_t scanSemaphore_;                          /**< Semaphore to wait until the scan procedure completed. */
    uint8_t scanReportBuff_[BLE_MAX_SCAN_REPORT_BUF_LEN];   /**< Buffer to hold the scanned report data. */
    ble_data_t bleScanData_;                                /**< BLE scanned data. */
    Vector<hal_ble_addr_t> cache_;                          /**< Cached address of scanned devices to filter-out duplicated result. */
    Vector<hal_ble_gap_on_scan_result_evt_t> pendingResults_; /**< Caches the scanned advertising data until the scan response data is captured. */
    BleObject* bleObj_;                                     /**< Pointer to the BLE Object. */
    AtomicAllocedPool observerScannedDataPool_;             /**< Pool to allocate memory for scanned data. */
    on_ble_scan_result_cb_t scanResultCallBack_;            /**< Callback function on scan result. */
    void* context_;                                         /**< Context of the scan result callback function. */

    static const uint16_t OBSERVER_SCANNED_DATA_POOL_SIZE = 1024;

    bool chachedDevice(const hal_ble_addr_t& address) const;
    hal_ble_gap_on_scan_result_evt_t* chachedResult(const hal_ble_addr_t& address);
    void removeResult(const hal_ble_addr_t& address);
    void clearResult(void);
    int continueScanning(void);
    static void observerEventProcessedHook(const hal_ble_evts_t *event, void* context);
    static void processObserverEvents(const ble_evt_t* event, void* context);
};

class BleObject::ConnectionsManager {
public:
    typedef struct {
        uint8_t role;
        uint16_t connHandle;
        hal_ble_conn_params_t effectiveConnParams;
        hal_ble_addr_t peer;
    } BleConnection_t;

    ConnectionsManager(BleObject* obj);
    ~ConnectionsManager() = default;
    int init(void);
    int setPPCP(const hal_ble_conn_params_t* ppcp);
    int getPPCP(hal_ble_conn_params_t* ppcp) const;
    bool connecting(void) const;
    bool connected(const hal_ble_addr_t* address=nullptr);
    int connect(const hal_ble_addr_t* address);
    int connectCancel(void);
    int disconnect(uint16_t connHandle);
    int updateConnectionParams(uint16_t connHandle, const hal_ble_conn_params_t* params);
    int getConnectionParams(uint16_t connHandle, hal_ble_conn_params_t* params);
    bool valid(uint16_t connHandle);

private:
    uint8_t isConnecting_ : 1;                      /**< If it is connecting or not. */
    hal_ble_addr_t connectingAddr_;                 /**< Address of peer the Central is connecting to. */
    uint16_t disconnectingHandle_;                  /**< Handle of connection to be disconnected. */
    uint16_t connParamUpdateHandle_;                /**< Handle of the connection that is to send peripheral connection update request. */
    uint8_t connParamsUpdateAttempts_;              /**< Attempts for peripheral to update connection parameters. */
    os_timer_t connParamsUpdateTimer_;              /**< Timer used for sending peripheral connection update request after connection established. */
    os_semaphore_t connParamsUpdateSemaphore_;      /**< Semaphore to wait until connection parameters updated. */
    os_semaphore_t connectSemaphore_;               /**< Semaphore to wait until connection established. */
    os_semaphore_t disconnectSemaphore_;            /**< Semaphore to wait until connection disconnected. */
    Vector<BleConnection_t> connections_;           /**< Current on-going connections. */
    BleObject* bleObj_;                             /**< Pointer to the BLE Object. */

    static const uint32_t CONNECTION_OPERATION_TIMEOUT_MS = 5000;

