particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
int BleObject::BleGap::setAppearance(uint16_t appearance) {
    int ret = sd_ble_gap_appearance_set(appearance);
    NRF_CHECK_RETURN(ret, "sd_ble_gap_appearance_set");
    return SYSTEM_ERROR_NONE;
}

int BleObject::BleGap::getAppearance(uint16_t* appearance) {
    if (appearance == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    int ret = sd_ble_gap_appearance_get(appearance);
    NRF_CHECK_RETURN(ret, "sd_ble_gap_appearance_get");
    return SYSTEM_ERROR_NONE;
}

int BleObject::BleGap::addWhitelist(const hal_ble_addr_t* addrList, uint8_t len) {
    if (addrList == nullptr || len == 0 || len > BLE_MAX_WHITELIST_ADDR_COUNT) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    for (uint8_t i = 0; i < len; i++) {
        whitelist_[i].addr_id_peer = true;
        whitelist_[i].addr_type = addrList[i].addr_type;
        memcpy(whitelist_[i].addr, addrList[i].addr, BLE_SIG_ADDR_LEN);
        whitelistPointer_[i] = &whitelist_[i];
    }
    int ret = sd_ble_gap_whitelist_set(whitelistPointer_, len);
    NRF_CHECK_RETURN(ret, "sd_ble_gap_whitelist_set");
    return SYSTEM_ERROR_NONE;
}

int BleObject::BleGap::deleteWhitelist(void) {
    int ret = sd_ble_gap_whitelist_set(nullptr, 0);
    NRF_CHECK_RETURN(ret, "sd_ble_gap_whitelist_set");
    return SYSTEM_ERROR_NONE;
}

void BleObject::BleGap::processBleGapEvents(const ble_evt_t* event, void* context) {
    int ret;
    switch (event->header.evt_id) {
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: physical update request.");
            ble_gap_phys_t phys = {};
            phys.rx_phys = BLE_GAP_PHY_AUTO;
            phys.tx_phys = BLE_GAP_PHY_AUTO;
            ret = sd_ble_gap_phy_update(event->evt.gap_evt.conn_handle, &phys);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_phy_update() failed: %u", (unsigned)ret);
            }
        } break;
        case BLE_GAP_EVT_PHY_UPDATE: {
            LOG_DEBUG(TRACE, "BLE GAP event: physical updated.");
        } break;
        case BLE_GAP_EVT_DATA_LENGTH_UPDATE: {
            LOG_DEBUG(TRACE, "BLE GAP event: gap data length updated.");
            LOG_DEBUG(TRACE, "| txo    rxo     txt(us)     rxt(us) |.");
            LOG_DEBUG(TRACE, "  %d    %d     %d        %d",
                    event->evt.gap_evt.params.data_length_update.effective_params.max_tx_octets, event->evt.gap_evt.params.data_length_update.effective_params.max_rx_octets,
                    event->evt.gap_evt.params.data_length_update.effective_params.max_tx_time_us, event->evt.gap_evt.params.data_length_update.effective_params.max_rx_time_us);
        } break;
        case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: gap data length update request.");
            ble_gap_data_length_params_t gapDataLenParams;
            gapDataLenParams.max_tx_octets  = BLE_GAP_DATA_LENGTH_AUTO;
            gapDataLenParams.max_rx_octets  = BLE_GAP_DATA_LENGTH_AUTO;
            gapDataLenParams.max_tx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
            gapDataLenParams.max_rx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
            ret = sd_ble_gap_data_length_update(event->evt.gap_evt.conn_handle, &gapDataLenParams, nullptr);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_data_length_update() failed: %u", (unsigned)ret);
            }
        } break;
        case BLE_GAP_EVT_SEC_PARAMS_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: security parameters request.");
            // Pairing is not supported
            ret = sd_ble_gap_sec_params_reply(event->evt.gap_evt.conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, nullptr, nullptr);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_sec_params_reply() failed: %u", (unsigned)ret);
            }
        } break;
        case BLE_GAP_EVT_AUTH_STATUS: {
            LOG_DEBUG(TRACE, "BLE GAP event: authentication status updated.");
            if (event->evt.gap_evt.params.auth_status.auth_status == BLE_GAP_SEC_STATUS_SUCCESS) {
                LOG_DEBUG(TRACE, "Authentication succeeded");
            } else {
                LOG_DEBUG(WARN, "Authentication failed, status: %d", (int)event->evt.gap_evt.params.auth_status.auth_status);
            }
        } break;
        case BLE_GAP_EVT_TIMEOUT: {
            if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_AUTH_PAYLOAD) {
                LOG_DEBUG(ERROR, "BLE GAP event: Authenticated payload timeout");
            }
        } break;
        default: {
            //LOG_DEBUG(TRACE, "Unhandled BLE event: %u", (unsigned)event->header.evt_id);
        } break;
    }
}

/* FIXME: It causes a section type conflict if using NRF_SDH_BLE_OBSERVER() in c++ class.*/
typedef struct {
    BleObject::Broadcaster* instance;
} BroadcasterImpl;
static BroadcasterImpl broadcasterImpl;

BleObject::Broadcaster::Broadcaster(BleObject* obj) : bleObj_(obj) {
    isAdvertising_ = false;
    advPending_ = false;
    advHandle_ = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
    connHandle_ = BLE_INVALID_CONN_HANDLE;
    /* Default advertising parameters. */
    advParams_.version = 0x01;
    advParams_.type = BLE_ADV_CONNECTABLE_SCANNABLE_UNDIRECRED_EVT;
    advParams_.filter_policy = BLE_ADV_FP_ANY;
    advParams_.interval = BLE_DEFAULT_ADVERTISING_INTERVAL;
    advParams_.timeout = BLE_DEFAULT_ADVERTISING_TIMEOUT;
    advParams_.inc_tx_power = false;
    memset(advData_, 0x00, sizeof(advData_));
    memset(scanRespData_, 0x00, sizeof(scanRespData_));
    advDataLen_ = scanRespDataLen_ = 0;
    /* Default advertising data. */
    // FLags
    advData_[advDataLen_++] = 0x02;
    advData_[advDataLen_++] = BLE_SIG_AD_TYPE_FLAGS;
    advData_[advDataLen_++] = BLE_SIG_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    /* Default TX power. */
    txPower_ = 0;
}

int BleObject::Broadcaster::init(void) {
    int ret = configure(&advParams_);
    CHECK_RETURN(ret, nullptr);
    setTxPower(txPower_);
    broadcasterImpl.instance = this;
    NRF_SDH_BLE_OBSERVER(bleBroadcaster, 1, processBroadcasterEvents, &broadcasterImpl);
    return SYSTEM_ERROR_NONE;
}

