particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
typedef struct {
    BleObject::Observer* instance;
} ObserverImpl;
static ObserverImpl observerImpl;

BleObject::Observer::Observer(BleObject* obj) : bleObj_(obj) {
    isScanning_ = false;
    scanParams_.version = 0x01;
    scanParams_.active = true;
    scanParams_.filter_policy = BLE_SCAN_FP_ACCEPT_ALL;
    scanParams_.interval = BLE_DEFAULT_SCANNING_INTERVAL;
    scanParams_.window = BLE_DEFAULT_SCANNING_WINDOW;
    scanParams_.timeout = BLE_DEFAULT_SCANNING_TIMEOUT;
    scanSemaphore_ = nullptr;
    bleScanData_.p_data = scanReportBuff_;
    bleScanData_.len = sizeof(scanReportBuff_);
    scanResultCallBack_ = nullptr;
    context_ = nullptr;
}

int BleObject::Observer::init(void) {
    observerScannedDataPool_.init(OBSERVER_SCANNED_DATA_POOL_SIZE);
    observerImpl.instance = this;
    NRF_SDH_BLE_OBSERVER(bleObserver, 1, processObserverEvents, &observerImpl);
    return SYSTEM_ERROR_NONE;
}

bool BleObject::Observer::scanning(void) {
    return isScanning_;
}

int BleObject::Observer::setScanParams(const hal_ble_scan_params_t* params) {
    if (params == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if ((params->interval < BLE_GAP_SCAN_INTERVAL_MIN) ||
            (params->interval > BLE_GAP_SCAN_INTERVAL_MAX) ||
            (params->window < BLE_GAP_SCAN_WINDOW_MIN) ||
            (params->window > BLE_GAP_SCAN_WINDOW_MAX) ||
            (params->window > params->interval) ) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    memcpy(&scanParams_, params, sizeof(hal_ble_scan_params_t));
    return SYSTEM_ERROR_NONE;
}

int BleObject::Observer::getScanParams(hal_ble_scan_params_t* params) const {
    if (params == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    memcpy(params, &scanParams_, sizeof(hal_ble_scan_params_t));
    return SYSTEM_ERROR_NONE;
}

int BleObject::Observer::continueScanning(void) {
    int ret = sd_ble_gap_scan_start(nullptr, &bleScanData_);
    NRF_CHECK_RETURN(ret, "sd_ble_gap_scan_start");
    return SYSTEM_ERROR_NONE;
}

int BleObject::Observer::startScanning(on_ble_scan_result_cb_t callback, void* context) {
    if (isScanning_) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (os_semaphore_create(&scanSemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    ble_gap_scan_params_t bleGapScanParams;
    toPlatformScanParams(&bleGapScanParams);
    LOG_DEBUG(TRACE, "| interval(ms)   window(ms)   timeout(ms) |");
    LOG_DEBUG(TRACE, "  %.3f        %.3f      %d",
            bleGapScanParams.interval*0.625, bleGapScanParams.window*0.625, bleGapScanParams.timeout*10);
    cache_.clear();
    scanResultCallBack_ = callback;
    context_ = context;
    int ret = sd_ble_gap_scan_start(&bleGapScanParams, &bleScanData_);
    NRF_CHECK_RETURN(ret, "sd_ble_gap_scan_start");
    isScanning_ = true;
    ret = SYSTEM_ERROR_NONE;
    if (os_semaphore_take(scanSemaphore_, CONCURRENT_WAIT_FOREVER, false)) {
        ret = SYSTEM_ERROR_TIMEOUT;
    }
    os_semaphore_destroy(scanSemaphore_);
    isScanning_ = false;
    cache_.clear();
    clearResult();
    return ret;
}

int BleObject::Observer::stopScanning(void) {
    if (!isScanning_) {
        return SYSTEM_ERROR_NONE;
    }
    int ret = sd_ble_gap_scan_stop();
    NRF_CHECK_RETURN(ret, "sd_ble_gap_scan_stop");
    os_semaphore_give(scanSemaphore_, false);
    return SYSTEM_ERROR_NONE;
}

void BleObject::Observer::toPlatformScanParams(ble_gap_scan_params_t* params) const {
    memset(params, 0x00, sizeof(ble_gap_scan_params_t));
    params->extended = 0;
    params->active = scanParams_.active;
    params->interval = scanParams_.interval;
    params->window = scanParams_.window;
    params->timeout = scanParams_.timeout;
    params->scan_phys = BLE_GAP_PHY_1MBPS;
    params->filter_policy = scanParams_.filter_policy;
}

bool BleObject::Observer::chachedDevice(const hal_ble_addr_t& address) const {
    for (int i = 0; i < cache_.size(); i++) {
        const hal_ble_addr_t& addr = cache_[i];
        if (addressEqual(addr, address)) {
            return true;
        }
    }
    return false;
}

hal_ble_gap_on_scan_result_evt_t* BleObject::Observer::chachedResult(const hal_ble_addr_t& address) {
    for (int i = 0; i < pendingResults_.size(); i++) {
        hal_ble_gap_on_scan_result_evt_t& result = pendingResults_[i];
        if (addressEqual(result.peer_addr, address)) {
            return &result;
        }
    }
    return nullptr;
}

void BleObject::Observer::removeResult(const hal_ble_addr_t& address) {
    for (int i = 0; i < pendingResults_.size(); i++) {
        const hal_ble_gap_on_scan_result_evt_t& result = pendingResults_[i];
        if (addressEqual(result.peer_addr, address)) {
            pendingResults_.removeAt(i);
            return;
        }
    }
}

void BleObject::Observer::clearResult(void) {
    for (int i = 0; i < pendingResults_.size(); i++) {
        const hal_ble_gap_on_scan_result_evt_t& result = pendingResults_[i];
        if (result.adv_data != nullptr) {
            observerScannedDataPool_.free(result.adv_data);
            LOG_DEBUG(TRACE, "clearResult: Free Scanned adv_data memory: %u", (unsigned)result.adv_data);
        }
    }
    pendingResults_.clear();
}

void BleObject::Observer::observerEventProcessedHook(const hal_ble_evts_t *event, void* context) {
    Observer* observer = static_cast<Observer*>(context);
    if (observer && event && event->type == BLE_EVT_SCAN_RESULT) {
        if (event->params.scan_result.adv_data != nullptr) {
            observer->observerScannedDataPool_.free(event->params.scan_result.adv_data);
            LOG_DEBUG(TRACE, "Hook: Free Scanned adv_data memory: %u", (unsigned)event->params.scan_result.adv_data);
        }
        if (event->params.scan_result.sr_data != nullptr) {
            observer->observerScannedDataPool_.free(event->params.scan_result.sr_data);
            LOG_DEBUG(TRACE, "Hook: Free Scanned sr_data memory: %u", (unsigned)event->params.scan_result.sr_data);
        }
    }
}

void BleObject::Observer::processObserverEvents(const ble_evt_t* event, void* context) {
    Observer* observer = static_cast<ObserverImpl*>(context)->instance;
    switch (event->header.evt_id) {
        case BLE_GAP_EVT_ADV_REPORT: {
            const ble_gap_evt_adv_report_t& advReport = event->evt.gap_evt.params.adv_report;
            hal_ble_addr_t newAddr;
            newAddr.addr_type = advReport.peer_addr.addr_type;
            memcpy(newAddr.addr, advReport.peer_addr.addr, BLE_SIG_ADDR_LEN);
            //LOG_DEBUG(TRACE, "BLE GAP event: advertising report.");
            if (!observer->chachedDevice(newAddr)) {
                if (!observer->scanParams_.active || !advReport.type.scannable) {
                    observer->cache_.append(newAddr);
                    uint8_t* advData = (uint8_t*)observer->observerScannedDataPool_.alloc(advReport.data.len);
                    if (advData) {
                        LOG_DEBUG(TRACE, "Scanned adv_data address: %u, len: %u", (unsigned)advData, advReport.data.len);
                        BleObject::BleEventDispatcher::EventMessage msg;
                        memset(&msg.evt.params.scan_result, 0x00, sizeof(hal_ble_gap_on_scan_result_evt_t));
                        msg.evt.type = BLE_EVT_SCAN_RESULT;
                        msg.evt.params.scan_result.version = 0x01;
                        msg.evt.params.scan_result.type.connectable = advReport.type.connectable;
                        msg.evt.params.scan_result.type.scannable = advReport.type.scannable;
                        msg.evt.params.scan_result.type.directed = advReport.type.directed;
                        msg.evt.params.scan_result.type.extended_pdu = advReport.type.extended_pdu;
                        msg.evt.params.scan_result.rssi = advReport.rssi;
                        msg.evt.params.scan_result.peer_addr.addr_type = advReport.peer_addr.addr_type;
                        memcpy(msg.evt.params.scan_result.peer_addr.addr, advReport.peer_addr.addr, BLE_SIG_ADDR_LEN);
                        msg.evt.params.scan_result.adv_data_len = advReport.data.len;
                        memcpy(advData, advReport.data.p_data, advReport.data.len);
                        msg.evt.params.scan_result.adv_data = advData;
                        msg.handler = (BleObject::BleEventDispatcher::BleSpecificEventHandler)observer->scanResultCallBack_;
                        msg.context = observer->context_;
                        msg.hook = observer->observerEventProcessedHook;
                        msg.hookContext = observer;
                        observer->bleObj_->dispatcher->enqueue(msg);
                    }
                } else if (advReport.type.scannable) {
                    if (!advReport.type.scan_response) {
                        if (observer->chachedResult(newAddr) == nullptr) {
                            uint8_t* advData = (uint8_t*)observer->observerScannedDataPool_.alloc(advReport.data.len);
                            if (advData) {
                                LOG_DEBUG(TRACE, "Cached adv_data address: %u, len: %u", (unsigned)advData, advReport.data.len);
                                hal_ble_gap_on_scan_result_evt_t result;
                                memset(&result, 0x00, sizeof(hal_ble_gap_on_scan_result_evt_t));
                                result.version = 0x01;
                                result.type.connectable = advReport.type.connectable;
                                result.type.scannable = advReport.type.scannable;
                                result.type.directed = advReport.type.directed;
                                result.type.extended_pdu = advReport.type.extended_pdu;
                                result.rssi = advReport.rssi;
                                result.peer_addr.addr_type = newAddr.addr_type;
                                memcpy(result.peer_addr.addr, newAddr.addr, BLE_SIG_ADDR_LEN);
                                result.adv_data_len = advReport.data.len;
                                memcpy(advData, advReport.data.p_data, advReport.data.len);
                                result.adv_data = advData;
                                observer->pendingResults_.append(result);
                            }
                        }
                    } else {
                        hal_ble_gap_on_scan_result_evt_t* result = observer->chachedResult(newAddr);
                        if (result) {
                            result->rssi = advReport.rssi;
                            result->sr_data = nullptr;
                            result->sr_data_len = advReport.data.len;
                            if (advReport.data.len > 0) {
                                uint8_t* srData = (uint8_t*)observer->observerScannedDataPool_.alloc(advReport.data.len);
                                if (srData) {
                                    LOG_DEBUG(TRACE, "Scanned sr_data address: %u, len: %u", (unsigned)srData, advReport.data.len);
                                    memcpy(srData, advReport.data.p_data, advReport.data.len);
                                    result->sr_data = srData;
                                } else {
                                    result->sr_data_len = 0;
                                }
                            }
                            BleObject::BleEventDispatcher::EventMessage msg;
                            msg.evt.type = BLE_EVT_SCAN_RESULT;
                            msg.evt.params.scan_result = *result;
                            msg.handler = (BleObject::BleEventDispatcher::BleSpecificEventHandler)observer->scanResultCallBack_;
                            msg.context = observer->context_;
                            msg.hook = observer->observerEventProcessedHook;
                            msg.hookContext = observer;
                            observer->bleObj_->dispatcher->enqueue(msg);
                            observer->removeResult(newAddr);
                            observer->cache_.append(newAddr);
                        }
                    }
                }
            }
            // Continue scanning
            observer->continueScanning();
        } break;
        case BLE_GAP_EVT_TIMEOUT: {
            if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN) {
                LOG_DEBUG(TRACE, "BLE GAP event: Scanning timeout");
                os_semaphore_give(observer->scanSemaphore_, false);
            }
        } break;
        default: break;
    }
}

