particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
bool BleObject::ConnectionsManager::valid(uint16_t connHandle) {
    const BleConnection_t* connection = fetchConnection(connHandle);
    return connection != nullptr;
}

void BleObject::ConnectionsManager::toPlatformConnParams(ble_gap_conn_params_t* params, const hal_ble_conn_params_t* halConnParams) {
    memset(params, 0x00, sizeof(ble_gap_conn_params_t));
    params->min_conn_interval = halConnParams->min_conn_interval;
    params->max_conn_interval = halConnParams->max_conn_interval;
    params->slave_latency = halConnParams->slave_latency;
    params->conn_sup_timeout = halConnParams->conn_sup_timeout;
}

void BleObject::ConnectionsManager::toHalConnParams(hal_ble_conn_params_t* halConnParams, const ble_gap_conn_params_t* params) {
    memset(halConnParams, 0x00, sizeof(hal_ble_conn_params_t));
    halConnParams->min_conn_interval = params->min_conn_interval;
    halConnParams->max_conn_interval = params->max_conn_interval;
    halConnParams->slave_latency = params->slave_latency;
    halConnParams->conn_sup_timeout = params->conn_sup_timeout;
}

BleObject::ConnectionsManager::BleConnection_t* BleObject::ConnectionsManager::fetchConnection(uint16_t connHandle) {
    if (connHandle == BLE_INVALID_CONN_HANDLE) {
        return nullptr;
    }
    for (int i = 0; i < connections_.size(); i++) {
        BleConnection_t& connection = connections_.at(i);
        if (connection.connHandle == connHandle) {
            return &connection;
        }
    }
    return nullptr;
}

BleObject::ConnectionsManager::BleConnection_t* BleObject::ConnectionsManager::fetchConnection(const hal_ble_addr_t* address) {
    if (address == nullptr) {
        return nullptr;
    }
    for (int i = 0; i < connections_.size(); i++) {
        BleConnection_t& connection = connections_.at(i);
        hal_ble_addr_t& peer = connection.peer;
        if (addressEqual(peer, *address)) {
            return &connection;
        }
    }
    return nullptr;
}

void BleObject::ConnectionsManager::addConnection(const BleConnection_t& connection) {
    removeConnection(connection.connHandle);
    connections_.append(connection);
}

void BleObject::ConnectionsManager::removeConnection(uint16_t connHandle) {
    for (int i = 0; i < connections_.size(); i++) {
        const BleConnection_t& connection = connections_[i];
        if (connection.connHandle == connHandle) {
            connections_.removeAt(i);
        }
    }
}

void BleObject::ConnectionsManager::initiateConnParamsUpdateIfNeeded(const BleConnection_t* connection) {
    if (connParamsUpdateTimer_ == nullptr) {
        return;
    }
    if (!isConnParamsFeeded(&connection->effectiveConnParams)) {
        if (connParamsUpdateAttempts_ < BLE_CONN_PARAMS_UPDATE_ATTEMPS) {
            if (!os_timer_change(connParamsUpdateTimer_, OS_TIMER_CHANGE_START, true, 0, 0, nullptr)) {
                LOG_DEBUG(TRACE, "Attempts to update BLE connection parameters, try: %d after %d ms",
                        connParamsUpdateAttempts_, BLE_CONN_PARAMS_UPDATE_DELAY_MS);
                connParamUpdateHandle_ = connection->connHandle;
                return;
            }
        } else {
            int ret = sd_ble_gap_disconnect(connection->connHandle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
            NRF_CHECK_RETURN_VOID(ret, "sd_ble_gap_disconnect");
            LOG_DEBUG(TRACE, "Disconnecting. Update BLE connection parameters failed.");
        }
    }
}

bool BleObject::ConnectionsManager::isConnParamsFeeded(const hal_ble_conn_params_t* params) const {
    hal_ble_conn_params_t ppcp;
    if (getPPCP(&ppcp) == SYSTEM_ERROR_NONE) {
        uint16_t minAcceptedSl = ppcp.slave_latency - MIN(BLE_CONN_PARAMS_SLAVE_LATENCY_ERR, ppcp.slave_latency);
        uint16_t maxAcceptedSl = ppcp.slave_latency + BLE_CONN_PARAMS_SLAVE_LATENCY_ERR;
        uint16_t minAcceptedTo = ppcp.conn_sup_timeout - MIN(BLE_CONN_PARAMS_TIMEOUT_ERR, ppcp.conn_sup_timeout);
        uint16_t maxAcceptedTo = ppcp.conn_sup_timeout + BLE_CONN_PARAMS_TIMEOUT_ERR;
        if (params->max_conn_interval < ppcp.min_conn_interval ||
                params->max_conn_interval > ppcp.max_conn_interval) {
            return false;
        }
        if (params->slave_latency < minAcceptedSl ||
                params->slave_latency > maxAcceptedSl) {
            return false;
        }
        if (params->conn_sup_timeout < minAcceptedTo ||
                params->conn_sup_timeout > maxAcceptedTo) {
            return false;
        }
    }
    return true;
}

void BleObject::ConnectionsManager::onConnParamsUpdateTimerExpired(os_timer_t timer) {
    ConnectionsManager* connMgr;
    os_timer_get_id(timer, (void**)&connMgr);
    if (connMgr->connParamUpdateHandle_ == BLE_INVALID_CONN_HANDLE) {
        return;
    }
    // For Peripheral, it will use the PPCP characteristic value.
    int ret = sd_ble_gap_conn_param_update(connMgr->connParamUpdateHandle_, nullptr);
    if (ret != NRF_SUCCESS) {
        sd_ble_gap_disconnect(connMgr->connParamUpdateHandle_, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        LOG_DEBUG(TRACE, "Disconnecting. Update BLE connection parameters failed.");
        NRF_CHECK_RETURN_VOID(ret, "sd_ble_gap_conn_param_update");
    }
    connMgr->connParamsUpdateAttempts_++;
}

void BleObject::ConnectionsManager::processConnectionEvents(const ble_evt_t* event, void* context) {
    ConnectionsManager* connMgr = static_cast<ConnectionsManagerImpl*>(context)->instance;
    switch (event->header.evt_id) {
        case BLE_GAP_EVT_CONNECTED: {
            const ble_gap_evt_connected_t& connected = event->evt.gap_evt.params.connected;
            LOG_DEBUG(TRACE, "BLE GAP event: connected.");
            BleConnection_t newConnection;
            newConnection.role = connected.role;
            newConnection.connHandle = event->evt.gap_evt.conn_handle;
            connMgr->toHalConnParams(&newConnection.effectiveConnParams, &connected.conn_params);
            newConnection.peer.addr_type = connected.peer_addr.addr_type;
            memcpy(newConnection.peer.addr, connected.peer_addr.addr, BLE_SIG_ADDR_LEN);
            connMgr->addConnection(newConnection);
            LOG_DEBUG(TRACE, "BLE role: %d, connection handle: %d", newConnection.role, newConnection.connHandle);
            LOG_DEBUG(TRACE, "| interval(ms)  latency  timeout(ms) |");
            LOG_DEBUG(TRACE, "  %.2f          %d       %d", newConnection.effectiveConnParams.max_conn_interval*1.25,
                    newConnection.effectiveConnParams.slave_latency, newConnection.effectiveConnParams.conn_sup_timeout*10);
            // If the connection is initiated by Central.
            if (connMgr->isConnecting_ && newConnection.peer.addr_type == connMgr->connectingAddr_.addr_type &&
                    !memcmp(newConnection.peer.addr, connMgr->connectingAddr_.addr, BLE_SIG_ADDR_LEN)) {
                os_semaphore_give(connMgr->connectSemaphore_, false);
            }
            // Update connection parameters if needed.
            if (newConnection.role == BLE_ROLE_PERIPHERAL) {
                connMgr->connParamsUpdateAttempts_ = 0;
                connMgr->initiateConnParamsUpdateIfNeeded(&newConnection);
            }
            BleObject::BleEventDispatcher::EventMessage msg;
            msg.evt.type = BLE_EVT_CONNECTED;
            msg.evt.params.connected.version = 0x01;
            msg.evt.params.connected.role = newConnection.role;
            msg.evt.params.connected.conn_handle = newConnection.connHandle;
            msg.evt.params.connected.conn_interval = newConnection.effectiveConnParams.max_conn_interval;
            msg.evt.params.connected.slave_latency = newConnection.effectiveConnParams.slave_latency;
            msg.evt.params.connected.conn_sup_timeout = newConnection.effectiveConnParams.conn_sup_timeout;
            msg.evt.params.connected.peer_addr.addr_type = newConnection.peer.addr_type;
            memcpy(msg.evt.params.connected.peer_addr.addr, newConnection.peer.addr, BLE_SIG_ADDR_LEN);
            connMgr->bleObj_->dispatcher->enqueue(msg);
        } break;
        case BLE_GAP_EVT_DISCONNECTED: {
            const ble_gap_evt_disconnected_t& disconnected = event->evt.gap_evt.params.disconnected;
            LOG_DEBUG(TRACE, "BLE GAP event: disconnected, handle: 0x%04X, reason: %d", event->evt.gap_evt.conn_handle, disconnected.reason);
            BleConnection_t* connection = connMgr->fetchConnection(event->evt.gap_evt.conn_handle);
            if (connection != nullptr) {
                // Cancel the on-going connection parameters update procedure.
                if (connMgr->connParamUpdateHandle_ == event->evt.gap_evt.conn_handle) {
                    if (connection->role == BLE_ROLE_PERIPHERAL) {
                        connMgr->connParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
                        if (!os_timer_is_active(connMgr->connParamsUpdateTimer_, nullptr)) {
                            os_timer_change(connMgr->connParamsUpdateTimer_, OS_TIMER_CHANGE_STOP, true, 0, 0, nullptr);
                        }
                    } else {
                        os_semaphore_give(connMgr->connParamsUpdateSemaphore_, false);
                    }
                }
                if (connMgr->disconnectingHandle_ == event->evt.gap_evt.conn_handle) {
                    os_semaphore_give(connMgr->disconnectSemaphore_, false);
                }
                connMgr->removeConnection(event->evt.gap_evt.conn_handle);
            } else {
                LOG(ERROR, "Connection not found.");
                return;
            }
            BleObject::BleEventDispatcher::EventMessage msg;
            msg.evt.type = BLE_EVT_DISCONNECTED;
            msg.evt.params.disconnected.version = 0x01;
            msg.evt.params.disconnected.reason = disconnected.reason;
            msg.evt.params.disconnected.conn_handle = event->evt.gap_evt.conn_handle;
            connMgr->bleObj_->dispatcher->enqueue(msg);
        } break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: connection parameter update request.");
            int ret = sd_ble_gap_conn_param_update(event->evt.gap_evt.conn_handle,
                    &event->evt.gap_evt.params.conn_param_update_request.conn_params);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_conn_param_update() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE: {
            const ble_gap_evt_conn_param_update_t& connParaUpdate = event->evt.gap_evt.params.conn_param_update;
            LOG_DEBUG(TRACE, "BLE GAP event: connection parameter updated.");
            BleConnection_t* connection = connMgr->fetchConnection(event->evt.gap_evt.conn_handle);
            if (connection != nullptr) {
                connMgr->toHalConnParams(&connection->effectiveConnParams, &connParaUpdate.conn_params);
                if (connection->role == BLE_ROLE_PERIPHERAL) {
                    connMgr->initiateConnParamsUpdateIfNeeded(connection);
                } else {
                    os_semaphore_give(connMgr->connParamsUpdateSemaphore_, false);
                }
            } else {
                LOG(ERROR, "Connection not found.");
                return;
            }
            LOG_DEBUG(TRACE, "| interval(ms)  latency  timeout(ms) |");
            LOG_DEBUG(TRACE, "  %.2f          %d       %d", connection->effectiveConnParams.max_conn_interval*1.25,
                    connection->effectiveConnParams.slave_latency, connection->effectiveConnParams.conn_sup_timeout*10);
            BleObject::BleEventDispatcher::EventMessage msg;
            msg.evt.type = BLE_EVT_CONN_PARAMS_UPDATED;
            msg.evt.params.conn_params_updated.version = 0x01;
            msg.evt.params.conn_params_updated.conn_handle = event->evt.gap_evt.conn_handle;
            msg.evt.params.conn_params_updated.conn_interval = connParaUpdate.conn_params.max_conn_interval;
            msg.evt.params.conn_params_updated.slave_latency = connParaUpdate.conn_params.slave_latency;
            msg.evt.params.conn_params_updated.conn_sup_timeout = connParaUpdate.conn_params.conn_sup_timeout;
            connMgr->bleObj_->dispatcher->enqueue(msg);
        } break;
        case BLE_GAP_EVT_TIMEOUT: {
            if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN) {
                LOG_DEBUG(ERROR, "BLE GAP event: Connection timeout");
                if (connMgr->isConnecting_) {
                    os_semaphore_give(connMgr->connectSemaphore_, false);
                }
            }
        } break;
        default: break;
    }
}

