particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
int ble_gap_set_ppcp(const hal_ble_conn_params_t* ppcp, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_set_ppcp().");
    return BleObject::getInstance().connectionsMgr->setPPCP(ppcp);
}

int ble_gap_get_ppcp(hal_ble_conn_params_t* ppcp, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_get_ppcp().");
    return BleObject::getInstance().connectionsMgr->getPPCP(ppcp);
}

int ble_gap_add_whitelist(const hal_ble_addr_t* addr_list, uint8_t len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_add_whitelist().");
    return BleObject::getInstance().gap->addWhitelist(addr_list, len);
}

int ble_gap_delete_whitelist(void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_delete_whitelist().");
    return BleObject::getInstance().gap->deleteWhitelist();
}

int ble_gap_set_tx_power(int8_t value) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_set_tx_power().");
    return BleObject::getInstance().broadcaster->setTxPower(value);
}

int8_t ble_gap_get_tx_power(void) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_get_tx_power().");
    return BleObject::getInstance().broadcaster->getTxPower();
}

int ble_gap_set_advertising_parameters(const hal_ble_adv_params_t* adv_params, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_set_advertising_parameters().");
    return BleObject::getInstance().broadcaster->setAdvertisingParams(adv_params);
}

int ble_gap_get_advertising_parameters(hal_ble_adv_params_t* adv_params, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_get_advertising_parameters().");
    return BleObject::getInstance().broadcaster->getAdvertisingParams(adv_params);
}

int ble_gap_set_advertising_data(const uint8_t* buf, uint16_t len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_set_advertising_data().");
    return BleObject::getInstance().broadcaster->setAdvertisingData(buf, len);
}

size_t ble_gap_get_advertising_data(uint8_t* buf, uint16_t len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_get_advertising_data().");
    return BleObject::getInstance().broadcaster->getAdvertisingData(buf, len);
}

int ble_gap_set_scan_response_data(const uint8_t* buf, uint16_t len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_set_scan_response_data().");
    return BleObject::getInstance().broadcaster->setScanResponseData(buf, len);
}

size_t ble_gap_get_scan_response_data(uint8_t* buf, uint16_t len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_get_scan_response_data().");
    return BleObject::getInstance().broadcaster->getScanResponseData(buf, len);
}

int ble_gap_start_advertising(void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_start_advertising().");
    return BleObject::getInstance().broadcaster->startAdvertising();
}

int ble_gap_stop_advertising(void) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_stop_advertising().");
    return BleObject::getInstance().broadcaster->stopAdvertising();
}

bool ble_gap_is_advertising(void) {
    return BleObject::getInstance().broadcaster->advertising();
}

int ble_gap_set_scan_parameters(const hal_ble_scan_params_t* scan_params, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_set_scan_parameters().");
    return BleObject::getInstance().observer->setScanParams(scan_params);
}

int ble_gap_get_scan_parameters(hal_ble_scan_params_t* scan_params, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_set_scan_parameters().");
    return BleObject::getInstance().observer->getScanParams(scan_params);
}

int ble_gap_start_scan(on_ble_scan_result_cb_t callback, void* context, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_start_scan().");
    return BleObject::getInstance().observer->startScanning(callback, context);
}

bool ble_gap_is_scanning(void) {
    return BleObject::getInstance().observer->scanning();
}

int ble_gap_stop_scan(void) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_stop_scan().");
    return BleObject::getInstance().observer->stopScanning();
}

int ble_gap_connect(const hal_ble_addr_t* address, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_connect().");
    return BleObject::getInstance().connectionsMgr->connect(address);
}

bool ble_gap_is_connecting(void) {
    return BleObject::getInstance().connectionsMgr->connecting();
}

bool ble_gap_is_connected(const hal_ble_addr_t* address) {
    return BleObject::getInstance().connectionsMgr->connected(address);
}

int ble_gap_connect_cancel(void) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_connect_cancel().");
    return BleObject::getInstance().connectionsMgr->connectCancel();
}

int ble_gap_disconnect(uint16_t conn_handle, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_disconnect().");
    return BleObject::getInstance().connectionsMgr->disconnect(conn_handle);
}

int ble_gap_update_connection_params(uint16_t conn_handle, const hal_ble_conn_params_t* conn_params, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_update_connection_params().");
    return BleObject::getInstance().connectionsMgr->updateConnectionParams(conn_handle, conn_params);
}

int ble_gap_get_connection_params(uint16_t conn_handle, hal_ble_conn_params_t* conn_params, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_update_connection_params().");
    return BleObject::getInstance().connectionsMgr->getConnectionParams(conn_handle, conn_params);
}

int ble_gap_get_rssi(uint16_t conn_handle, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gap_get_rssi().");
    return 0;
}

/**********************************************
 * BLE GATT Server APIs
 */
int ble_gatt_server_add_service(uint8_t type, const hal_ble_uuid_t* uuid, uint16_t* handle, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gatt_server_add_service().");
    return BleObject::getInstance().gatts->addService(type, uuid, handle);
}

int ble_gatt_server_add_characteristic(const hal_ble_char_init_t* char_init, hal_ble_char_handles_t* handles, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gatt_server_add_characteristic().");
    return BleObject::getInstance().gatts->addCharacteristic(char_init->service_handle, char_init->properties, &char_init->uuid, char_init->description, handles);
}

int ble_gatt_server_add_descriptor(const hal_ble_desc_init_t* desc_init, uint16_t* handle, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gatt_server_add_descriptor().");
    return BleObject::getInstance().gatts->addDescriptor(desc_init->char_handle, &desc_init->uuid, desc_init->descriptor, desc_init->len, handle);
}

